app/controllers/lists_controller.rb

    def show
        list = List.find(params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]