app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"
---
    def index
        workouts = Workout.all